[
  {
    "name": "red",
    "meaning": "Red is the color of fire and blood, so it is associated with energy, war, danger, strength, power, determination as well as passion, desire, and love."
  },

  {
    "name": "orange",
    "meaning": "Orange combines the energy of red and the happiness of yellow. It is associated with joy, sunshine, and the tropics. Orange represents enthusiasm, fascination, happiness, creativity, determination, attraction, success, encouragement, and stimulation."
  },
  {
    "name": "yellow",
    "meaning": "Yellow is the color of sunshine. It's associated with joy, happiness, intellect, and energy. Carotenoids give the characteristic yellow color to autumn leaves, corn, canaries, daffodils, and lemons, as well as egg yolks, buttercups, and bananas. Yellow absorbs light energy and protect plants from photodamage."
  },
  {
    "name": "green",
    "meaning": "Green is the color of nature. It symbolizes growth, harmony, freshness, and fertility. Green, as opposed to red, means safety; it is the color of free passage in road traffic."
  },
  {
    "name": "blue",
    "meaning": "Blue is the color of the sky and sea. It is often associated with depth and stability. It symbolizes trust, loyalty, wisdom, confidence, intelligence, faith, truth, and heaven. Blue is considered beneficial to the mind and body. It slows human metabolism and produces a calming effect. Blue is strongly associated with tranquility and calmness."
  },
  {
    "name": "purple",
    "meaning": "Purple combines the stability of blue and the energy of red. Purple is associated with royalty. It symbolizes power, nobility, luxury, and ambition. It conveys wealth and extravagance. Purple is associated with wisdom, dignity, independence, creativity, mystery, and magic."
  },
  {
    "name": "white",
    "meaning": "White is the lightest color and is achromatic (having no hue), because it fully reflects and scatters all the visible wavelengths of light. It is the color of fresh snow, chalk, and milk. White is sometimes associated with light, goodness, innocence, purity, and virginity."
  },
  {
    "name": "black",
    "meaning": "Black is the darkest color, the result of the absence or complete absorption of visible light. Black was one of the first colors used by artists in neolithic cave paintings. They began by using charcoal, and then made more vivid black pigments by burning bones or grinding a powder of manganese oxide."
  },
  {
    "name": "brown",
    "meaning": "Brown is a composite color. Brown is made by combining red, black, and yellow. Brown is seen widely in nature, in wood, soil, human hair color, eye color and skin pigmentation. Brown is the color of dark wood or rich soil. The term is from Old English brún, in origin for any dusky or dark shade of color. The first recorded use of brown as a color name in English was in 1000."
  },
  {
    "name": "gray",
    "meaning": "Gray is an intermediate color between black and white. The first recorded use of grey as a color name in the English language was in AD 700. Grey is the color most commonly associated with neutrality, conformity, boredom, uncertainty, old age, indifference, and modesty."
  },
  {
    "name": "pink",
    "meaning": "Pink is named after the flowers, \"pinks\", flowering plants in the genus Dianthus, and derives from the frilled edge of the flowers. It was first used as a color name in the late 17th century."
  }
]
